In [2]:
import pandas as pd
from sklearn.model_selection import train_test_split

In [3]:
df = pd.read_csv('../../Desktop/Machine Learning/data/titanic/train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
import numpy as np
x = df['Pclass']
y = df['Survived']
x = np.array(x).reshape(-1,1)
y= np.array(y).reshape(-1,1)
Xtrain , Xtest, ytrain, ytest = train_test_split(x,y,train_size=0.3,test_size=0.7)

In [5]:
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score,confusion_matrix,classification_report

In [6]:
train = LogisticRegression()
model= train.fit(Xtrain,ytrain)
pred = model.predict(Xtest)

/home/nasir/.local/lib/python3.8/site-packages/sklearn/utils/validation.py:1111: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [7]:
accuracy = model.score(Xtest,ytest)
print('accuracy is : ',accuracy)
print(classification_report(ytest,pred))

accuracy is :  0.6682692307692307
              precision    recall  f1-score   support

           0       0.68      0.85      0.76       381
           1       0.62      0.38      0.47       243

    accuracy                           0.67       624
   macro avg       0.65      0.62      0.61       624
weighted avg       0.66      0.67      0.65       624

In [8]:
from sklearn.tree import DecisionTreeClassifier
model2 = DecisionTreeClassifier()
testtree= model2.fit(Xtrain,ytrain)
accuracy1= model2.score(Xtest,ytest)
print('the accuracy is : ',accuracy1)

the accuracy is :  0.6682692307692307

In [9]:
from sklearn.preprocessing import LabelEncoder
x1 = df['Sex']
le = LabelEncoder()
le.fit(x1)
x1= le.transform(x1)
x1 = np.array(x1).reshape(-1,1)
Xtrain1,Xtest1,ytrain1,ytest1 = train_test_split(x1,y,train_size=0.5)

In [10]:
sex = model.fit(Xtrain1,ytrain1)
accu = sex.score(Xtest1,ytest1)
print('the accuracy is ', accu)
sexpred = model.predict(Xtest1)
print(classification_report(ytest1,sexpred))

the accuracy is  0.7959641255605381
              precision    recall  f1-score   support

           0       0.81      0.85      0.83       264
           1       0.77      0.72      0.74       182

    accuracy                           0.80       446
   macro avg       0.79      0.78      0.79       446
weighted avg       0.79      0.80      0.79       446

/home/nasir/.local/lib/python3.8/site-packages/sklearn/utils/validation.py:1111: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [32]:
from sklearn.multioutput import MultiOutputClassifier
x2 = x1
x2 = pd.DataFrame(x2)
x2[['Pclass','SibSp']]  =df[['Pclass','SibSp']]
x2.head()

   0  Pclass  SibSp
0  1       3      1
1  0       1      1
2  0       3      0
3  0       1      1
4  1       3      0

In [33]:
Xtrain,Xtest,ytrain,ytest = train_test_split(x2,y,train_size=0.35)
model3 = MultiOutputClassifier(LogisticRegression()).fit(Xtrain,ytrain)
model4 = MultiOutputClassifier(DecisionTreeClassifier()).fit(Xtrain,ytrain)

/home/nasir/.local/lib/python3.8/site-packages/sklearn/utils/validation.py:1858: FutureWarning: Feature names only support names that are all strings. Got feature names with dtypes: ['int', 'str']. An error will be raised in 1.2.
  warnings.warn(
/home/nasir/.local/lib/python3.8/site-packages/sklearn/utils/validation.py:1858: FutureWarning: Feature names only support names that are all strings. Got feature names with dtypes: ['int', 'str']. An error will be raised in 1.2.
  warnings.warn(

In [34]:
accu = model3.score(Xtest,ytest)
print('the accuracy is ',accu)
accu = model4.score(Xtest,ytest)
print('the accuracy is ',accu)

the accuracy is  0.7586206896551724
the accuracy is  0.7844827586206896

/home/nasir/.local/lib/python3.8/site-packages/sklearn/utils/validation.py:1858: FutureWarning: Feature names only support names that are all strings. Got feature names with dtypes: ['int', 'str']. An error will be raised in 1.2.
  warnings.warn(
/home/nasir/.local/lib/python3.8/site-packages/sklearn/utils/validation.py:1858: FutureWarning: Feature names only support names that are all strings. Got feature names with dtypes: ['int', 'str']. An error will be raised in 1.2.
  warnings.warn(

In [12]:
testdf = pd.read_csv('../../Desktop/Machine Learning/data/titanic/test.csv')
testdf.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [13]:
Testx = testdf['Sex']
Testx = le.transform(Testx)
Testx = np.array(Testx).reshape(-1,1)

In [14]:
testpred = model.predict(Testx)
finaldf = testdf
finaldf['survived'] = testpred

In [15]:
finaldf.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,1
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,1

In [16]:
logisticsresult = finaldf[['PassengerId','survived']].copy()

In [17]:
logisticsresult.loc[0] = 892 , 0
logisticsresult.loc[1] = 893 , 1
logisticsresult.head()

   PassengerId  survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [18]:
#logisticsresult.to_csv('../../Desktop/Machine Learning/data/titanic/logistictitanic.csv')